In [11]:
import pandas as pd
import numpy as np

In [12]:
sozlukVerisi = {"Istanbul":[30,19,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,38]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [13]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      19.0     NaN     39
2       NaN    25.0     38

In [14]:
havaDurumuDataFrame.dropna() #içi boş olanları çıkardı

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [15]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      19.0     NaN     39
2       NaN    25.0     38

In [16]:
havaDurumuDataFrame.dropna(axis = 1)

   Izmir
0     40
1     39
2     38

In [17]:
yeniVeri = {"Istanbul":[30,19,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,38],"Antalya":[45,np.nan,np.nan]}
yeniDataFrame = pd.DataFrame(yeniVeri)

In [18]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      19.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [19]:
yeniDataFrame.dropna(axis=1, thresh=2) ## 2 ve üzeri olan nan ları atıyor.

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      19.0     NaN     39
2       NaN    25.0     38

In [20]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      19.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [21]:
yeniDataFrame.fillna(20)#boş olanları doldur anlamında.

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      19.0    20.0     39     20.0
2      20.0    25.0     38     20.0

## groupby

In [22]:
maasSozlugu = {"Departman":["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
               "Calisan Ismi":["Ahmet","Mehmet","Pınar","Burak","Sedef","Can"],
               "Maas": [100,150,200,300,400,500]
              }

In [23]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [24]:
maasDataFrame

   Departman Calisan Ismi  Maas
0    Yazılım        Ahmet   100
1    Yazılım       Mehmet   150
2  Pazarlama        Pınar   200
3  Pazarlama        Burak   300
4      Hukuk        Sedef   400
5      Hukuk          Can   500

In [25]:
grupObjesi = maasDataFrame.groupby("Departman")

In [26]:
grupObjesi.count()

           Calisan Ismi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [27]:
grupObjesi.mean() ## ortalama maası gormek icin

C:\Users\sumey\AppData\Local\Temp\ipykernel_19412\460958615.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  grupObjesi.mean() ## ortalama maası gormek icin

            Maas
Departman
Hukuk      450.0
Pazarlama  250.0
Yazılım    125.0

In [28]:
grupObjesi.min()

          Calisan Ismi  Maas
Departman
Hukuk              Can   400
Pazarlama        Burak   200
Yazılım          Ahmet   100

In [29]:
grupObjesi.max()

          Calisan Ismi  Maas
Departman
Hukuk            Sedef   500
Pazarlama        Pınar   300
Yazılım         Mehmet   150

In [30]:
grupObjesi.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0